{
  "schemes":[
    {
      "scheme_name" : "Soil Health Card Scheme",
      "reference_imageUrl" : "https://www.indianbureaucracy.com/wp-content/uploads/2020/02/Soil-Health-Card-scheme.jpg",
      "schemes_benefits" : "Launched in 2015, the scheme has been introduced to assist State Governments to issue Soil Health Cards to all farmers in the country.  The Soil Health Cards provide information to farmers on nutrient status of their soil alongwith recommendation on appropriate dosage of nutrients to be applied for improving soil health and its fertility. As on 11.7.2017, against target of 253 lakh soil samples, all 253 lakh soil samples have been collected and 245 lakh (97%) samples have been tested.  Against target of 12 crore Soil Health Cards, so far 9 crore (76%) cards have been distributed to farmers",
      "scheme_apply" : "https://www.soilhealth.dac.gov.in/home"
    },
    {
      "scheme_name" : "Neem Coated Urea (NCU)",
      "reference_imageUrl" : "https://th.bing.com/th/id/OIP.79j72OX8T7Oygk8riUw96AHaEK?pid=ImgDet&rs=1",
      "schemes_benefits" : "Scheme being promoted to regulate use of urea, enhance availability of nitrogen to the crop and reduce cost of fertilizer application.  NCU slows down the release of fertilizer and makes it available to the crop in an effective manner. The entire quantity of domestically manufactured and imported urea is now neem coated. The reports from field are positive. The expected saving is 10% of urea consumption, thereby resulting in reduced cost of cultivation and improved soil health management.",
      "scheme_apply" : "https://www.fert.nic.in/sites/default/files/What-is-new/Neem-Coated.pdf"
    },
    {
      "scheme_name" : "Paramparagat Krishi Vikas Yojana  (PKVY)",
      "reference_imageUrl" : "https://www.papertyari.com/wp-content/uploads/2020/04/Paramparagat-Krishi-Vikas-Yojana.png?x19810",
      "schemes_benefits" : "Paramparagat Krishi Vikas Yojana (PKVY) is being implemented with a view to promote organic farming in the country.  This will improve soil health and organic matter content and increase net income of the farmer so as to realise premium prices. Under this scheme, an area of 5 lakh acre is targeted to be covered though 10,000 clusters of 50 acre each, from the year 2015-16 to 2017-18. So far 7208 clusters have been formed and remaining  clusters would be formed during 2017-18.",
      "scheme_apply" : "https://darpg.gov.in/sites/default/files/Paramparagat%20Krishi%20Vikas%20Yojana.pdf"
    },
    {
      "scheme_name" : "Pradhan Mantri Krishi Sinchayee Yojana (PMKSY)",
      "reference_imageUrl" : "https://i.ytimg.com/vi/UPvNtY8wLRk/maxresdefault.jpg",
      "schemes_benefits" : "Launched on 1st July, 2015 with the motto of ‘Har Khet Ko Paani’, the Pradhan Mantri Krishi Sinchayee Yojana (PMKSY) is being implemented to expand cultivated area with assured irrigation, reduce wastage of water and improve water use efficiency. PMKSY not only focuses on creating sources for assured irrigation, but also creating protective irrigation by harnessing rain water at micro level through ‘Jal Sanchay’ and ‘Jal Sinchan’.  Micro irrigation is also incentivized through subsidy to ensure ‘Per drop-More crop’.  The target under micro-irrigation for the year 2016-17 was 8 lakh ha. against which 8.39 lakh ha have been covered.",
      "scheme_apply" : "https://pmksy.gov.in/"
    },
    {
      "scheme_name" : "National Agriculture Market (e-NAM):",
      "reference_imageUrl" : "https://www.finacbooks.com/assets/img/blog/pradhan-mantri-fasal-bima-yojana.jpg",
      "schemes_benefits" : "Pradhan Mantri Fasal Bima Yojana (PMFBY) & Restructured Weather Based Crop Insurance Scheme (RWBCIS) were launched from Kharif 2016 to provide comprehensive crop insurance coverage from pre-sowing to post harvest losses against non-preventable natural risks.  These schemes are only risk mitigation tools available to farmers at extremely low premium rates payable by farmers at 2% for Kharif crops, 1.5% for Rabi Crop and 5% for annual commercial/horticultural crops.  The balance of actuarial premium is shared by the Central and State Governments on 50 : 50 basis.  The schemes are voluntary for States and available in areas and crops that are notified by the State Governments. Further, the schemes are compulsory for loanee farmers and voluntary for non-loanee farmers.  During Kharif 2016 season, a total of 23 States implemented both PMFBY (21) and RWBCS (12) and during Rabi 2016-17, 24 States and 3 Union Territories implemented PMFBY (25) and RWBCIS (9).    Overall coverage of both the schemes is 401.52 lakh farmers and 385 lakh ha. area insured for a sum of Rs. 133106 crore in Kharif 2016 and 172.67 lakh farmers and 195 lakh ha. area insured for a sum of Rs. 71696 crore during Rabi 2016-17 season",
      "scheme_apply" : "https://www.enam.gov.in/web/"
    },
    {
      "scheme_name" : "Interest Subvention Scheme (ISS)",
      "reference_imageUrl" : "https://corpbiz.io/learning/wp-content/uploads/2020/10/Interest-Subvention-Scheme-for-MSMEs.jpg",
      "schemes_benefits" : "The Government provides interest subvention of 3% on short-term crop loans up to Rs.3.00 lakh.  Presently, loan is available to farmers at an interest rate of 7% per annum, which gets reduced to 4% on prompt repayment.  Further, under Interest Subvention Scheme 2016-17, in order to provide relief to the farmers on occurrence of natural calamities, the interest subvention of 2% shall continue to be available to banks for the first year on the restructured amount. In order to discourage distress sale by farmers and to encourage them to store their produce in warehouses against negotiable warehouse receipts, the benefit of interest subvention will be available to small and marginal farmers having Kisan Credit Card for a further period of upto six months post harvest on the same rate as available to crop loan. Agriculture is a State subject and the State Governments are primarily responsible for the growth and development of agriculture sector in their respective States. The Government supplements the efforts of States through appropriate policy measures and budgetary support.  Presently the approach of the Government of India has shifted from production centric to income centric platform in the agriculture sector and the above schemes are being implemented for making farming viable.",
      "scheme_apply" : "https://www.nabard.org/content1.aspx?id=602&catid=23&mid=23"
    },
    {
      "scheme_name" : "Pradhan Mantri Fasal Bima Yojana (PMFBY)/ Restructured Weather Based Crop Insurance Scheme (RWBCIS) ",
      "reference_imageUrl" : "https://www.mygov.in/sites/all/themes/mygov/images/pmfby/pmfby-banner.jpg",
      "schemes_benefits" : "Pradhan Mantri Fasal Bima Yojana (PMFBY) & Restructured Weather Based Crop Insurance Scheme (RWBCIS) were launched from Kharif 2016 to provide comprehensive crop insurance coverage from pre-sowing to post harvest losses against non-preventable natural risks.These schemes are only risk mitigation tools available to farmers at extremely low premium rates payable by farmers at 2% for Kharif crops, 1.5% for Rabi Crop and 5% for annual commercial/horticultural crops.  The balance of actuarial premium is shared by the Central and State Governments on 50 : 50 basis.  The schemes are voluntary for States and available in areas and crops that are notified by the State Governments.Further, the schemes are compulsory for loanee farmers and voluntary for non-loanee farmers.",
      "scheme_apply" : "https://agricoop.nic.in/Documents/RWBCIS%20Revised%20Guidelines_1.pdf"
    },
    {
      "scheme_name" : "Agriculture Infrastructure Fund",
      "reference_imageUrl" : "https://static.vikaspedia.in/mediastorage/image/AIF.jpeg",
      "schemes_benefits" : "All loans under this financing facility will have interest subvention of 3% per annum up to a limit of Rs 2 crore.This subvention will be available for a maximum period of seven years.Further,credit guarantee coverage will be available for eligible borrowers from this financing facility under Credit Guarantee Fund Trust for Micro and Small Enterprises (CGTMSE) scheme for a loan up to Rs. 2 crore.The fee for this coverage will be paid by the Government.In case of FPOs the credit guarantee may be availed from the facility created under FPO promotion scheme of Department of Agriculture,Cooperation & Farmers Welfare (DACFW).Moratorium for repayment under this financing facility may vary subject to minimum of 6 months and maximum of 2 years ",
      "scheme_apply" : "https://agriinfra.dac.gov.in/Home/BeneficiaryRegistration"
    }
  ]
}